RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_aes.h
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_CbcMac_Update
****************************************************************************//**
*
* Performs an AES CBC MAC Multistage update operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param srcSize
* The size of the source block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/                                            
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_CbcMac_Update(CRYPTOLITE_Type *base,
                                            uint32_t srcSize,
                                            uint8_t const *src,
                                            cy_stc_cryptolite_aes_state_t *aesState);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_CbcMac_Finish
****************************************************************************//**
*
* Performs an AES CBC MAC finish operation.
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param mac
* The pointer to store the calculated mac.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/                                            
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_CbcMac_Finish(CRYPTOLITE_Type *base, uint8_t * mac, cy_stc_cryptolite_aes_state_t *aesState);                                                                                 
#endif /*CY_CRYPTOLITE_CFG_CBC_MAC_C*/

#endif /*CY_CRYPTOLITE_CFG_CIPHER_MODE_CBC*/



#if defined(CY_CRYPTOLITE_CFG_CIPHER_MODE_CFB)
/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb
********************************************************************************//**
*
* Performs AES operation on a plain text with the Cipher Feedback Block method (CFB).
*
* \param base
* The pointer to the CRYPTOLITE instance.
*
* \param dirMode
* \ref cy_en_cryptolite_dir_mode_t
*
* \param srcSize
* The size of the source plain text.
*
* \param ivPtr
* The pointer to the initial vector.
*
* \param dst
* The pointer to a destination cipher text.
*
* \param src
* The pointer to a source plain text.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user must
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Aes_Cfb
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb(CRYPTOLITE_Type *base,
                                             cy_en_cryptolite_dir_mode_t dirMode,
                                             uint32_t srcSize,
                                             uint8_t *ivPtr,
                                             uint8_t *dst,
                                             uint8_t const *src,
                                             cy_stc_cryptolite_aes_state_t *aesState);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb_Setup
****************************************************************************//**
*
* Performs an AES CFB setup operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param dirMode
* Can be \ref CY_CRYPTOLITE_ENCRYPT or \ref CY_CRYPTO_DECRYPT
* (\ref cy_en_cryptolite_dir_mode_t).
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/                                             
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb_Setup(CRYPTOLITE_Type *base,
                                            cy_en_cryptolite_dir_mode_t dirMode,
                                            cy_stc_cryptolite_aes_state_t *aesState);


/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb_Set_IV
****************************************************************************//**
*
* Sets IV for AES CFB mode.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param iv
* The pointer to iv.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/                                            
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb_Set_IV(CRYPTOLITE_Type *base,
                                            uint8_t const * iv,
                                            cy_stc_cryptolite_aes_state_t *aesState);

/*******************************************************************************
* Function Name: Cy_Cryptolite_Aes_Cfb_Update
****************************************************************************//**
*
* Performs an AES CFB Multistage update operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_cryptolite_status_t
*
*******************************************************************************/                                            
cy_en_cryptolite_status_t Cy_Cryptolite_Aes_Cfb_Update(CRYPTOLITE_Type *base,
                                             uint32_t srcSize,
                                             uint8_t *dst,
                                             uint8_t const *src,
                                             cy_stc_cryptolite_aes_state_t *aesState);


